Add updated docs
